package lesson_3

fun main() {
    var whereFrom = "E2"
    var where = "E4"
    var chessMove = 1

    println("$whereFrom на $where; $chessMove")

    whereFrom = "E4"
    where = "E5"
    chessMove = 2

    println("$whereFrom на $where; $chessMove")
    // Добрый вечер. Иван я опять не понимаю условия задачи. Первая часть понятна.
    // А вторая вероятно предполагает какие то доп. знания.
    // Определить, какое значение будет в переменной "куда" для фигуры, стоящей на D2
    // и продвинувшейся на одну клетку вперед. Я понимаю что это вероятно пешка и пойдет
    // она на D3. Но почему она появилась и как ее определить я не понимаю. Спасибо.

}